app/controllers/orders_controller.rb

  def new
    @cart = current_cart
    if current_cart.adoptions.empty?
---
SELECT 1 AS one FROM "adoptions" WHERE "adoptions"."cart_id" = ? LIMIT 1  [["cart_id", 3]]